# Data Cleaning & Dataset Integration

## What I Did
- Cleaned 4 raw e-commerce datasets
- Handled missing values and inconsistent data types
- Integrated datasets into a unified analytical dataset
- Prepared final dataset with 850K+ records

In [2]:
#importing necessary library and load click_stream datasets
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
click_stream=pd.read_csv("click_stream.csv")
click_stream.head()

,session_id,event_name,event_time,event_id,traffic_source,event_metadata
0,fb0abf9e-fd1a-44dd-b5c0-2834d5a4b81c,HOMEPAGE,2019-09-06T15:54:32.821085Z,9c4388c4-c95b-4678-b5ca-e9cbc0734109,MOBILE,NaN
1,fb0abf9e-fd1a-44dd-b5c0-2834d5a4b81c,SCROLL,2019-09-06T16:03:57.821085Z,4690e1f5-3f99-42d3-84a5-22c4c4d8500a,MOBILE,NaN
2,7d440441-e67a-4d36-b324-80ffd636d166,HOMEPAGE,2019-09-01T12:05:10.322763Z,88aeaeb5-ec98-4859-852c-8abb483faf31,MOBILE,NaN
3,7d440441-e67a-4d36-b324-80ffd636d166,ADD_TO_CART,2019-09-01T12:06:33.322763Z,934e306e-ecc6-472f-9ccb-12c8536910a2,MOBILE,"{'product_id': 15315, 'quantity': 4, 'item_pri..."
4,7d440441-e67a-4d36-b324-80ffd636d166,BOOKING,2019-09-01T12:15:29.425431Z,9f4767a1-40fa-4c9c-9524-dfad18634d56,MOBILE,{'payment_status': 'Success'}

In [3]:
#checking  each column missing percentage
click_stream.isnull().mean()*100

session_id         0.00000
event_name         0.00000
event_time         0.00000
event_id           0.00000
traffic_source     0.00000
event_metadata    69.62039
dtype: float64

In [4]:
click_stream["event_metadata"].unique()

array([nan, "{'product_id': 15315, 'quantity': 4, 'item_price': 313529}",
       "{'payment_status': 'Success'}", ...,
       "{'product_id': 29735, 'quantity': 2, 'item_price': 284044}",
       "{'product_id': 9796, 'quantity': 1, 'item_price': 298869}",
       "{'product_id': 29234, 'quantity': 1, 'item_price': 548407}"],
      dtype=object)

In [5]:
#droping event_metadata column since its noise and we have this column in another table
click_stream.drop('event_metadata',axis=1,inplace=True)

In [6]:
click_stream.head()

,session_id,event_name,event_time,event_id,traffic_source
0,fb0abf9e-fd1a-44dd-b5c0-2834d5a4b81c,HOMEPAGE,2019-09-06T15:54:32.821085Z,9c4388c4-c95b-4678-b5ca-e9cbc0734109,MOBILE
1,fb0abf9e-fd1a-44dd-b5c0-2834d5a4b81c,SCROLL,2019-09-06T16:03:57.821085Z,4690e1f5-3f99-42d3-84a5-22c4c4d8500a,MOBILE
2,7d440441-e67a-4d36-b324-80ffd636d166,HOMEPAGE,2019-09-01T12:05:10.322763Z,88aeaeb5-ec98-4859-852c-8abb483faf31,MOBILE
3,7d440441-e67a-4d36-b324-80ffd636d166,ADD_TO_CART,2019-09-01T12:06:33.322763Z,934e306e-ecc6-472f-9ccb-12c8536910a2,MOBILE
4,7d440441-e67a-4d36-b324-80ffd636d166,BOOKING,2019-09-01T12:15:29.425431Z,9f4767a1-40fa-4c9c-9524-dfad18634d56,MOBILE

In [7]:
# drop any duplicates since session id ,event id should be unique
click_stream.drop_duplicates(subset=['session_id','event_id'],inplace=True)

In [8]:
#check the dimension of click stream datsets
click_stream.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 5 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   session_id      1048575 non-null  object
 1   event_name      1048575 non-null  object
 2   event_time      1048575 non-null  object
 3   event_id        1048575 non-null  object
 4   traffic_source  1048575 non-null  object
dtypes: object(5)
memory usage: 40.0+ MB

In [9]:
# since event_time is object we need to change  datatype  to datetime
click_stream['event_time'] = pd.to_datetime(click_stream['event_time'].str.replace('Z', ''), errors='coerce')

In [10]:
click_stream.head()

,session_id,event_name,event_time,event_id,traffic_source
0,fb0abf9e-fd1a-44dd-b5c0-2834d5a4b81c,HOMEPAGE,2019-09-06 15:54:32.821085,9c4388c4-c95b-4678-b5ca-e9cbc0734109,MOBILE
1,fb0abf9e-fd1a-44dd-b5c0-2834d5a4b81c,SCROLL,2019-09-06 16:03:57.821085,4690e1f5-3f99-42d3-84a5-22c4c4d8500a,MOBILE
2,7d440441-e67a-4d36-b324-80ffd636d166,HOMEPAGE,2019-09-01 12:05:10.322763,88aeaeb5-ec98-4859-852c-8abb483faf31,MOBILE
3,7d440441-e67a-4d36-b324-80ffd636d166,ADD_TO_CART,2019-09-01 12:06:33.322763,934e306e-ecc6-472f-9ccb-12c8536910a2,MOBILE
4,7d440441-e67a-4d36-b324-80ffd636d166,BOOKING,2019-09-01 12:15:29.425431,9f4767a1-40fa-4c9c-9524-dfad18634d56,MOBILE

In [11]:
click_stream.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 5 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   session_id      1048575 non-null  object
 1   event_name      1048575 non-null  object
 2   event_time      1048575 non-null  datetime64[ns]
 3   event_id        1048575 non-null  object
 4   traffic_source  1048575 non-null  object
dtypes: datetime64[ns](1), object(4)
memory usage: 40.0+ MB

In [12]:
click_stream.isnull().sum()

session_id        0
event_name        0
event_time        0
event_id          0
traffic_source    0
dtype: int64

In [13]:
#loading customers datasets
customer=pd.read_csv("customer.csv")
customer.head()

,customer_id,first_name,last_name,username,email,gender,birthdate,device_type,device_id,device_version,home_location_lat,home_location_long,home_location,home_country,first_join_date
0,2870,Lala,Maryati,671a0865-ac4e-4dc4-9c4f-c286a1176f7e,671a0865_ac4e_4dc4_9c4f_c286a1176f7e@startupca...,F,1996-06-14,iOS,c9c0de76-0a6c-4ac2-843f-65264ab9fe63,iPhone; CPU iPhone OS 14_2_1 like Mac OS X,-1.043345,101.360523,Sumatera Barat,Indonesia,2019-07-21
1,8193,Maimunah,Laksmiwati,83be2ba7-8133-48a4-bbcb-b46a2762473f,83be2ba7_8133_48a4_bbcb_b46a2762473f@zakyfound...,F,1993-08-16,Android,fb331c3d-f42e-40fe-afe2-b4b73a8a6e25,Android 2.2.1,-6.212489,106.818850,Jakarta Raya,Indonesia,2017-07-16
2,7279,Bakiman,Simanjuntak,3250e5a3-1d23-4675-a647-3281879d42be,3250e5a3_1d23_4675_a647_3281879d42be@startupca...,M,1989-01-23,iOS,d13dde0a-6ae1-43c3-83a7-11bbb922730b,iPad; CPU iPad OS 4_2_1 like Mac OS X,-8.631607,116.428436,Nusa Tenggara Barat,Indonesia,2020-08-23
3,88813,Cahyadi,Maheswara,df797edf-b465-4a80-973b-9fbb612260c2,df797edf_b465_4a80_973b_9fbb612260c2@zakyfound...,M,1991-01-05,iOS,f4c18515-c5be-419f-8142-f037be47c9cd,iPad; CPU iPad OS 14_2 like Mac OS X,1.299332,115.774934,Kalimantan Timur,Indonesia,2021-10-03
4,82542,Irnanto,Wijaya,36ab08e1-03de-42a8-9e3b-59528c798824,36ab08e1_03de_42a8_9e3b_59528c798824@startupca...,M,2000-07-15,iOS,e46e4c36-4630-4736-8fcf-663db29ca3b0,iPhone; CPU iPhone OS 10_3_3 like Mac OS X,-2.980807,114.924675,Kalimantan Selatan,Indonesia,2021-04-11

In [14]:
#drop duplicates from customer_id
customer.drop_duplicates(subset='customer_id',inplace=True)

In [15]:
# Change 2 datetime column data type from object to datetime
customer['first_join_date ']=pd.to_datetime(customer['first_join_date'])
customer['birthdate']=pd.to_datetime(customer['birthdate'])

In [16]:
# Creating customer full name column by merging two column and droping usual columns 
customer['full_name']=customer['first_name']+' '+customer['last_name']
customer.drop(['first_name','last_name','email','username','device_id','device_version'],axis=1,inplace=True)

In [17]:
# Creating Age columns from birthdate
import datetime
today=datetime.date.today()
customer['age']=today.year-customer['birthdate'].dt.year

In [18]:
customer.drop('birthdate',axis=1,inplace=True)

In [19]:
customer.head()

,customer_id,gender,device_type,home_location_lat,home_location_long,home_location,home_country,first_join_date,first_join_date,full_name,age
0,2870,F,iOS,-1.043345,101.360523,Sumatera Barat,Indonesia,2019-07-21,2019-07-21,Lala Maryati,30
1,8193,F,Android,-6.212489,106.818850,Jakarta Raya,Indonesia,2017-07-16,2017-07-16,Maimunah Laksmiwati,33
2,7279,M,iOS,-8.631607,116.428436,Nusa Tenggara Barat,Indonesia,2020-08-23,2020-08-23,Bakiman Simanjuntak,37
3,88813,M,iOS,1.299332,115.774934,Kalimantan Timur,Indonesia,2021-10-03,2021-10-03,Cahyadi Maheswara,35
4,82542,M,iOS,-2.980807,114.924675,Kalimantan Selatan,Indonesia,2021-04-11,2021-04-11,Irnanto Wijaya,26

In [20]:
# reorganizing gender column 
customer['gender'] = customer['gender'].str.lower()
customer['gender']=customer['gender'].replace({'f':'Female','m':'Male'})

In [21]:
customer['gender'].value_counts()

gender
Female    64230
Male      35770
Name: count, dtype: int64

In [22]:
customer.head()

,customer_id,gender,device_type,home_location_lat,home_location_long,home_location,home_country,first_join_date,first_join_date,full_name,age
0,2870,Female,iOS,-1.043345,101.360523,Sumatera Barat,Indonesia,2019-07-21,2019-07-21,Lala Maryati,30
1,8193,Female,Android,-6.212489,106.818850,Jakarta Raya,Indonesia,2017-07-16,2017-07-16,Maimunah Laksmiwati,33
2,7279,Male,iOS,-8.631607,116.428436,Nusa Tenggara Barat,Indonesia,2020-08-23,2020-08-23,Bakiman Simanjuntak,37
3,88813,Male,iOS,1.299332,115.774934,Kalimantan Timur,Indonesia,2021-10-03,2021-10-03,Cahyadi Maheswara,35
4,82542,Male,iOS,-2.980807,114.924675,Kalimantan Selatan,Indonesia,2021-04-11,2021-04-11,Irnanto Wijaya,26

In [23]:
#Loading Product datasets
product=pd.read_csv("product.csv",on_bad_lines='skip')
product.head()

,id,gender,masterCategory,subCategory,articleType,baseColour,season,year,usage,productDisplayName
0,15970,Men,Apparel,Topwear,Shirts,Navy Blue,Fall,2011.0,Casual,Turtle Check Men Navy Blue Shirt
1,39386,Men,Apparel,Bottomwear,Jeans,Blue,Summer,2012.0,Casual,Peter England Men Party Blue Jeans
2,59263,Women,Accessories,Watches,Watches,Silver,Winter,2016.0,Casual,Titan Women Silver Watch
3,21379,Men,Apparel,Bottomwear,Track Pants,Black,Fall,2011.0,Casual,Manchester United Men Solid Black Track Pants
4,53759,Men,Apparel,Topwear,Tshirts,Grey,Summer,2012.0,Casual,Puma Men Grey T-shirt

In [24]:
product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44424 entries, 0 to 44423
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  44424 non-null  int64
 1   gender              44424 non-null  object
 2   masterCategory      44424 non-null  object
 3   subCategory         44424 non-null  object
 4   articleType         44424 non-null  object
 5   baseColour          44409 non-null  object
 6   season              44403 non-null  object
 7   year                44423 non-null  float64
 8   usage               44107 non-null  object
 9   productDisplayName  44417 non-null  object
dtypes: float64(1), int64(1), object(8)
memory usage: 3.4+ MB

In [25]:
#droping duplicates from id in products datasets
product.drop_duplicates(subset='id',inplace=True)

In [26]:
product.isnull().sum()

id                      0
gender                  0
masterCategory          0
subCategory             0
articleType             0
baseColour             15
season                 21
year                    1
usage                 317
productDisplayName      7
dtype: int64

In [27]:
#droping missing value from year column
product.dropna(subset=['year'], inplace=True)
product['year'] = product['year'].astype(int)

In [28]:
product.info()

<class 'pandas.core.frame.DataFrame'>
Index: 44423 entries, 0 to 44423
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  44423 non-null  int64
 1   gender              44423 non-null  object
 2   masterCategory      44423 non-null  object
 3   subCategory         44423 non-null  object
 4   articleType         44423 non-null  object
 5   baseColour          44408 non-null  object
 6   season              44403 non-null  object
 7   year                44423 non-null  int64
 8   usage               44106 non-null  object
 9   productDisplayName  44416 non-null  object
dtypes: int64(2), object(8)
memory usage: 3.7+ MB

In [29]:
# fill missing value in 3 columns(baseColour,season,usage,productDisplayName)
product['baseColour'].fillna('Unknown', inplace=True)
product['season'].fillna('Unknown', inplace=True)
product['usage'].fillna('Unknown', inplace=True)

C:\Users\Emdad\AppData\Local\Temp\ipykernel_12948\1849861008.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  product['baseColour'].fillna('Unknown', inplace=True)
C:\Users\Emdad\AppData\Local\Temp\ipykernel_12948\1849861008.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  product['season'].fillna('Unknown', inplace=True)
C:\Users\Emdad\AppData\Local\Temp\ipykernel_12948\1849861008.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  product['usage'].fillna('Unknown', inplace=True)

In [30]:
product['productDisplayName'].fillna('Unknown', inplace=True)

C:\Users\Emdad\AppData\Local\Temp\ipykernel_12948\3530764214.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  product['productDisplayName'].fillna('Unknown', inplace=True)

In [31]:
#Checking wheather missng value exists or not
product.isnull().sum()

id                    0
gender                0
masterCategory        0
subCategory           0
articleType           0
baseColour            0
season                0
year                  0
usage                 0
productDisplayName    0
dtype: int64

In [32]:
#Transforming year column to datetime
product['year'] = pd.to_datetime(product['year'],format='%Y')

In [33]:
#Extract just year from year column
product['year']=product['year'].dt.year

In [34]:
product.head()

,id,gender,masterCategory,subCategory,articleType,baseColour,season,year,usage,productDisplayName
0,15970,Men,Apparel,Topwear,Shirts,Navy Blue,Fall,2011,Casual,Turtle Check Men Navy Blue Shirt
1,39386,Men,Apparel,Bottomwear,Jeans,Blue,Summer,2012,Casual,Peter England Men Party Blue Jeans
2,59263,Women,Accessories,Watches,Watches,Silver,Winter,2016,Casual,Titan Women Silver Watch
3,21379,Men,Apparel,Bottomwear,Track Pants,Black,Fall,2011,Casual,Manchester United Men Solid Black Track Pants
4,53759,Men,Apparel,Topwear,Tshirts,Grey,Summer,2012,Casual,Puma Men Grey T-shirt

In [35]:
#loading transaction datasets
import pandas as pd
import numpy as np
trans=pd.read_csv("trans.csv")
trans.head()

,created_at,customer_id,booking_id,session_id,product_metadata,payment_method,payment_status,promo_amount,promo_code,shipment_fee,shipment_date_limit,shipment_location_lat,shipment_location_long,total_amount
0,2018-07-29T15:22:01.458193Z,5868,186e2bee-0637-4710-8981-50c2d737bc42,3abaa6ce-e320-4e51-9469-d9f3fa328e86,"[{'product_id': 54728, 'quantity': 1, 'item_pr...",Debit Card,Success,1415,WEEKENDSERU,10000,2018-08-03T05:07:24.812676Z,-8.227893,111.969107,199832
1,2018-07-30T12:40:22.365620Z,4774,caadb57b-e808-4f94-9e96-8a7d4c9898db,2ee5ead1-f13e-4759-92df-7ff48475e970,"[{'product_id': 16193, 'quantity': 1, 'item_pr...",Credit Card,Success,0,NaN,10000,2018-08-03T01:29:03.415705Z,3.013470,107.802514,155526
2,2018-09-15T11:51:17.365620Z,4774,6000fffb-9c1a-4f4a-9296-bc8f6b622b50,93325fb6-eb00-4268-bb0e-6471795a0ad0,"[{'product_id': 53686, 'quantity': 4, 'item_pr...",OVO,Success,0,NaN,10000,2018-09-18T08:41:49.422380Z,-2.579428,115.743885,550696
3,2018-11-01T11:23:48.365620Z,4774,f5e530a7-4350-4cd1-a3bc-525b5037bcab,bcad5a61-1b67-448d-8ff4-781d67bc56e4,"[{'product_id': 20228, 'quantity': 1, 'item_pr...",Credit Card,Success,0,NaN,0,2018-11-05T17:42:27.954235Z,-3.602334,120.363823,271012
4,2018-12-18T11:20:30.365620Z,4774,0efc0594-dbbf-4f9a-b0b0-a488cfddf8a2,df1042ab-13e6-4072-b9d2-64a81974c51a,"[{'product_id': 55220, 'quantity': 1, 'item_pr...",Credit Card,Success,0,NaN,0,2018-12-23T17:24:07.361785Z,-3.602334,120.363823,198753

In [36]:
trans['product_metadata'].value_counts()

product_metadata
[{'product_id': 22822, 'quantity': 1, 'item_price': 327751}]    2
[{'product_id': 3359, 'quantity': 1, 'item_price': 250593}]     2
[{'product_id': 40577, 'quantity': 8, 'item_price': 403749}]    2
[{'product_id': 31709, 'quantity': 1, 'item_price': 92835}]     2
[{'product_id': 10834, 'quantity': 1, 'item_price': 345271}]    2
                                                               ..
[{'product_id': 45720, 'quantity': 1, 'item_price': 183844}]    1
[{'product_id': 58745, 'quantity': 1, 'item_price': 403082}]    1
[{'product_id': 12746, 'quantity': 6, 'item_price': 155618}]    1
[{'product_id': 42641, 'quantity': 1, 'item_price': 392964}]    1
[{'product_id': 47433, 'quantity': 1, 'item_price': 360687}]    1
Name: count, Length: 852566, dtype: int64

In [37]:
import ast

# Ensure proper parsing of product_metadata
trans['product_metadata'] = trans['product_metadata'].apply(ast.literal_eval)

# extract 3 important column from one column(product_metadata)
trans['product_id'] = trans['product_metadata'].apply(lambda x: x[0]['product_id'] if isinstance(x, list) and len(x) > 0 else None)
trans['quantity'] = trans['product_metadata'].apply(lambda x: x[0]['quantity'] if isinstance(x, list) and len(x) > 0 else None)
trans['item_price'] = trans['product_metadata'].apply(lambda x: x[0]['item_price'] if isinstance(x, list) and len(x) > 0 else None)

# Check for NaN values
print(trans[['product_id', 'quantity', 'item_price']].isna().sum())

product_id    0
quantity      0
item_price    0
dtype: int64

In [38]:
trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 852584 entries, 0 to 852583
Data columns (total 17 columns):
 #   Column                  Non-Null Count   Dtype
---  ------                  --------------   -----
 0   created_at              852584 non-null  object
 1   customer_id             852584 non-null  int64
 2   booking_id              852584 non-null  object
 3   session_id              852584 non-null  object
 4   product_metadata        852584 non-null  object
 5   payment_method          852584 non-null  object
 6   payment_status          852584 non-null  object
 7   promo_amount            852584 non-null  int64
 8   promo_code              326536 non-null  object
 9   shipment_fee            852584 non-null  int64
 10  shipment_date_limit     852584 non-null  object
 11  shipment_location_lat   852584 non-null  float64
 12  shipment_location_long  852584 non-null  float64
 13  total_amount            852584 non-null  int64
 14  product_id              852584 non-null  int64
 15  quantity                852584 non-null  int64
 16  item_price              852584 non-null  int64
dtypes: float64(2), int64(7), object(8)
memory usage: 110.6+ MB

In [39]:
#Check for missing value
trans.isnull().mean()

created_at                0.000000
customer_id               0.000000
booking_id                0.000000
session_id                0.000000
product_metadata          0.000000
payment_method            0.000000
payment_status            0.000000
promo_amount              0.000000
promo_code                0.617004
shipment_fee              0.000000
shipment_date_limit       0.000000
shipment_location_lat     0.000000
shipment_location_long    0.000000
total_amount              0.000000
product_id                0.000000
quantity                  0.000000
item_price                0.000000
dtype: float64

In [40]:
#filling missing value from promo_code
trans['promo_code']=trans['promo_code'].fillna('No promo code')

In [41]:
#droping duplicates value from booking_id,product_id column
trans.drop_duplicates(subset=['booking_id','product_id'], inplace=True)

In [42]:
#Changing datatype of two datetime column(created_at,shipment_date_limit) from object to datetime
trans['created_at']=pd.to_datetime(trans['created_at'].str.replace('Z',''),errors='coerce')
trans['shipment_date_limit']=pd.to_datetime(trans['shipment_date_limit'].str.replace('Z',''),errors='coerce')

In [43]:
trans.isnull().mean()

created_at                0.0
customer_id               0.0
booking_id                0.0
session_id                0.0
product_metadata          0.0
payment_method            0.0
payment_status            0.0
promo_amount              0.0
promo_code                0.0
shipment_fee              0.0
shipment_date_limit       0.0
shipment_location_lat     0.0
shipment_location_long    0.0
total_amount              0.0
product_id                0.0
quantity                  0.0
item_price                0.0
dtype: float64

In [44]:
trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 852584 entries, 0 to 852583
Data columns (total 17 columns):
 #   Column                  Non-Null Count   Dtype
---  ------                  --------------   -----
 0   created_at              852584 non-null  datetime64[ns]
 1   customer_id             852584 non-null  int64
 2   booking_id              852584 non-null  object
 3   session_id              852584 non-null  object
 4   product_metadata        852584 non-null  object
 5   payment_method          852584 non-null  object
 6   payment_status          852584 non-null  object
 7   promo_amount            852584 non-null  int64
 8   promo_code              852584 non-null  object
 9   shipment_fee            852584 non-null  int64
 10  shipment_date_limit     852584 non-null  datetime64[ns]
 11  shipment_location_lat   852584 non-null  float64
 12  shipment_location_long  852584 non-null  float64
 13  total_amount            852584 non-null  int64
 14  product_id              852584 non-null  int64
 15  quantity                852584 non-null  int64
 16  item_price              852584 non-null  int64
dtypes: datetime64[ns](2), float64(2), int64(7), object(6)
memory usage: 110.6+ MB

In [45]:
#droping product_metadata since i have already extract 3 column using this column
trans.drop('product_metadata',axis=1,inplace=True)

In [46]:
trans.head()

,created_at,customer_id,booking_id,session_id,payment_method,payment_status,promo_amount,promo_code,shipment_fee,shipment_date_limit,shipment_location_lat,shipment_location_long,total_amount,product_id,quantity,item_price
0,2018-07-29 15:22:01.458193,5868,186e2bee-0637-4710-8981-50c2d737bc42,3abaa6ce-e320-4e51-9469-d9f3fa328e86,Debit Card,Success,1415,WEEKENDSERU,10000,2018-08-03 05:07:24.812676,-8.227893,111.969107,199832,54728,1,191247
1,2018-07-30 12:40:22.365620,4774,caadb57b-e808-4f94-9e96-8a7d4c9898db,2ee5ead1-f13e-4759-92df-7ff48475e970,Credit Card,Success,0,No promo code,10000,2018-08-03 01:29:03.415705,3.013470,107.802514,155526,16193,1,145526
2,2018-09-15 11:51:17.365620,4774,6000fffb-9c1a-4f4a-9296-bc8f6b622b50,93325fb6-eb00-4268-bb0e-6471795a0ad0,OVO,Success,0,No promo code,10000,2018-09-18 08:41:49.422380,-2.579428,115.743885,550696,53686,4,135174
3,2018-11-01 11:23:48.365620,4774,f5e530a7-4350-4cd1-a3bc-525b5037bcab,bcad5a61-1b67-448d-8ff4-781d67bc56e4,Credit Card,Success,0,No promo code,0,2018-11-05 17:42:27.954235,-3.602334,120.363823,271012,20228,1,271012
4,2018-12-18 11:20:30.365620,4774,0efc0594-dbbf-4f9a-b0b0-a488cfddf8a2,df1042ab-13e6-4072-b9d2-64a81974c51a,Credit Card,Success,0,No promo code,0,2018-12-23 17:24:07.361785,-3.602334,120.363823,198753,55220,1,198753

In [47]:
#Creating sales column by multiplying quantity and item_price
trans['sales']=trans['quantity']*trans['item_price']

In [49]:
#Exporting all the 4 cleaned datasets
#customer.to_csv('cleaned_customer.csv', index=False)
#product.to_csv('cleaned_product.csv', index=False)
#trans.to_csv('cleaned_transactions.csv', index=False)
#click_stream.to_csv('cleaned_click_stream.csv', index=False)

In [51]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   customer_id         100000 non-null  int64
 1   gender              100000 non-null  object
 2   device_type         100000 non-null  object
 3   home_location_lat   100000 non-null  float64
 4   home_location_long  100000 non-null  float64
 5   home_location       100000 non-null  object
 6   home_country        100000 non-null  object
 7   first_join_date     100000 non-null  object
 8   first_join_date     100000 non-null  datetime64[ns]
 9   full_name           100000 non-null  object
 10  age                 100000 non-null  int32
dtypes: datetime64[ns](1), float64(2), int32(1), int64(1), object(6)
memory usage: 8.0+ MB

In [53]:
product.info()

<class 'pandas.core.frame.DataFrame'>
Index: 44423 entries, 0 to 44423
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  44423 non-null  int64
 1   gender              44423 non-null  object
 2   masterCategory      44423 non-null  object
 3   subCategory         44423 non-null  object
 4   articleType         44423 non-null  object
 5   baseColour          44423 non-null  object
 6   season              44423 non-null  object
 7   year                44423 non-null  int32
 8   usage               44423 non-null  object
 9   productDisplayName  44423 non-null  object
dtypes: int32(1), int64(1), object(8)
memory usage: 3.6+ MB

In [54]:
trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 852584 entries, 0 to 852583
Data columns (total 17 columns):
 #   Column                  Non-Null Count   Dtype
---  ------                  --------------   -----
 0   created_at              852584 non-null  datetime64[ns]
 1   customer_id             852584 non-null  int64
 2   booking_id              852584 non-null  object
 3   session_id              852584 non-null  object
 4   payment_method          852584 non-null  object
 5   payment_status          852584 non-null  object
 6   promo_amount            852584 non-null  int64
 7   promo_code              852584 non-null  object
 8   shipment_fee            852584 non-null  int64
 9   shipment_date_limit     852584 non-null  datetime64[ns]
 10  shipment_location_lat   852584 non-null  float64
 11  shipment_location_long  852584 non-null  float64
 12  total_amount            852584 non-null  int64
 13  product_id              852584 non-null  int64
 14  quantity                852584 non-null  int64
 15  item_price              852584 non-null  int64
 16  sales                   852584 non-null  int64
dtypes: datetime64[ns](2), float64(2), int64(8), object(5)
memory usage: 110.6+ MB

In [55]:
click_stream.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 5 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   session_id      1048575 non-null  object
 1   event_name      1048575 non-null  object
 2   event_time      1048575 non-null  datetime64[ns]
 3   event_id        1048575 non-null  object
 4   traffic_source  1048575 non-null  object
dtypes: datetime64[ns](1), object(4)
memory usage: 40.0+ MB

In [56]:
click_stream.head()

,session_id,event_name,event_time,event_id,traffic_source
0,fb0abf9e-fd1a-44dd-b5c0-2834d5a4b81c,HOMEPAGE,2019-09-06 15:54:32.821085,9c4388c4-c95b-4678-b5ca-e9cbc0734109,MOBILE
1,fb0abf9e-fd1a-44dd-b5c0-2834d5a4b81c,SCROLL,2019-09-06 16:03:57.821085,4690e1f5-3f99-42d3-84a5-22c4c4d8500a,MOBILE
2,7d440441-e67a-4d36-b324-80ffd636d166,HOMEPAGE,2019-09-01 12:05:10.322763,88aeaeb5-ec98-4859-852c-8abb483faf31,MOBILE
3,7d440441-e67a-4d36-b324-80ffd636d166,ADD_TO_CART,2019-09-01 12:06:33.322763,934e306e-ecc6-472f-9ccb-12c8536910a2,MOBILE
4,7d440441-e67a-4d36-b324-80ffd636d166,BOOKING,2019-09-01 12:15:29.425431,9f4767a1-40fa-4c9c-9524-dfad18634d56,MOBILE